#+property: header-args:rust :results output file :tangle src/main.rs :dir /path/to/my-rust-project

* My Rust Code
This is a code block for the project.

#+begin_src rust
fn main() {
    println!("Hello, world!");
    
}

#+end_src

#+RESULTS:
: Hello, world!
